{
  "channels": {
    "announcements": "Announcements from the JSON Schema organisation",
    "asyncapi": "Shared channel for JSON Schema and AsyncAPI slack servers. Ask questions, get help.",
    "community-mgmt": "Discussing our community, how it operates, and how we would like it to operate.",
    "contribute": "Discussing, sharing updates on, or getting help with any sort of contribution to the JSON Schema project.",
    "documentation": "Discussing the documentation of JSON Schema itself",
    "draft-publication": "Discussions related to the drafts to be published next",
    "events": "Discussions and queries related to any events related to JSON Schema community.",
    "general": ":wave: Discuss and ask questions about all JSON Schema related things.",
    "ghd-community": "Automated postings of created Discussions and comments from https://github.com/json-schema-org/community/discussions",
    "github": "Github stream of activity. You probably want to switch notifications to mention only mode!",
    "hyper-schema": "Discussions and queries related to vocabulary for annotating JSON documents with hyperlinks.",
    "implementers": "Development of validation libraries and other software tools. Questions about using these tools, and general schema authoring issues should go to #general",
    "adopters": "Discussions and queries related the JSON Schema Adopters and Case Studies",
    "in-the-wild": "Share all and every use of JSON Schema you see in the wild. See https://json-schema.slack.com/archives/C020M2HR37G/p1620122275000700",
    "introductions": "Break the ice, introduce yourself to our amazing community, and connect with each other!",
    "jobs": "Post job openings related to JSON Schema or APIs.",
    "jp": "コミュニティの日本語を話す友人と、JSONスキーマに関連するすべての会話について話し合い、参加します。完全なチャネルの説明を参照してください。",
    "openapi-dialect": "Discussions and queries related to OpenAPI JSON Schema dialect.",
    "slack-bot-test": "Kindly do not start any discussions here. This is just a channel to test the slack-bot.",
    "specification": "Potential changes to the specification text of JSON Schema",
    "stack-overflow": "Stackoverflow questions tagged with JSON Schema. Unrelated questions will be deleted.",
    "tests": "Development of the official test suite",
    "tsc-discussion": "A public place for the Technical Steering Committee to discuss current activities.",
    "twitter-mentions": "This channel is only for JSON Schema's Twitter mentions. Kindly do not discuss anything here.",
    "vocab-databases": "Discussions and posting queries related to the JSON Schema database vocabulary.",
    "vocab-forms": "JSON Schema's form generation vocabulary related discussions.",
    "vocab-idl": "Discussions related to the vocabulary built by the JSON Schema community for its interface description language.",
    "vocabularies": "https://github.com/json-schema-org/json-schema-vocabularies",
    "watercooler": "A communication channel for everyone who needs to chat and network but within the boundaries of our code of conduct.",
    "website": "Suggestions for and development of the JSON Schema website <https://json-schema.org/>",
    "z-random": "Non-work banter and water cooler conversation. Still in bounds for our code of conduct. OK"
  }
}
